Revit 2026 API

# CurveApproximateLength Property

---

The approximate length of the curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApproximateLength { get; }
```
```vb
Public ReadOnly Property ApproximateLength As Double
	Get
```
```cpp
public:
property double ApproximateLength {
	double get ();
}
```
```fsharp
member ApproximateLength : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the curve is unbound and not periodic. |

Quickly estimates the length of the curve, may deviate by a factor of 2 in some cases. The computation is exact for lines and arcs.

#### Reference

Curve Class

Autodesk.Revit.DB Namespace